[
  {
    "id": 1,
    "slug": "kitchen-trends-2025",
    "title": "Kitchen Worktop Trends to Watch This Year",
    "excerpt": "From bold veining to textured finishes, discover the surface trends that are defining modern kitchens.",
    "category": "Trends",
    "date": "2025-03-15",
    "readTime": "5 min read",
    "image": "/images/blog/trends-hero.jpg",
    "tags": ["trends", "design", "kitchen"],
    "content": "The kitchen worktop is no longer just a functional surface—it has become the centrepiece of open-plan living. This year, we are seeing a decisive shift towards dramatic veining patterns that mimic the grandeur of natural marble, but with the practical benefits of engineered stone.\n\nBold Veining Takes Centre Stage: Gone are the days of uniform, speckled surfaces. Homeowners and designers alike are gravitating towards slabs with sweeping, book-matched veins that create a visual narrative across kitchen islands.\n\nTextured Finishes Rise: Honed and leathered finishes are gaining ground over traditional polished surfaces, offering a tactile experience that feels more organic and contemporary.\n\nDark and Moody: Black and charcoal worktops continue to surge in popularity, particularly in handleless kitchens where they create a seamless, architectural statement.\n\nSustainable Choices: With environmental awareness at an all-time high, more customers are choosing engineered stone for its lower waste and longer lifespan compared to alternatives."
  },
  {
    "id": 2,
    "slug": "quartz-vs-granite-guide",
    "title": "Quartz vs Granite: The Definitive Comparison",
    "excerpt": "Not sure which material is right for your kitchen? We break down the pros, cons and costs of each.",
    "category": "Guides",
    "date": "2025-02-28",
    "readTime": "8 min read",
    "image": "/images/blog/quartz-vs-granite.jpg",
    "tags": ["guides", "quartz", "granite", "comparison"],
    "content": "Choosing between quartz and granite is one of the most common dilemmas our customers face. Both are premium materials with excellent credentials, but they suit different lifestyles and aesthetic preferences.\n\nConsistency vs Character: Engineered quartz offers predictable patterns—what you see in our showroom is what you get. Granite, by contrast, is a natural product where every slab tells a different story. If you value uniformity, choose quartz. If you treasure uniqueness, granite is your stone.\n\nMaintenance: Quartz requires virtually no maintenance—just wipe clean. Granite needs periodic resealing (typically once a year) to maintain its stain resistance.\n\nHeat Resistance: Granite wins here. It can handle hot pans directly, whereas quartz should be protected with trivets to prevent thermal shock.\n\nCost: Both materials occupy a similar price bracket, though exotic granites can be more expensive. Our engineered quartz starts from £245/m² while granite begins at £380/m²."
  },
  {
    "id": 3,
    "slug": "family-kitchen-transformation",
    "title": "Case Study: A Family Kitchen Transformed with Calacatta Gold",
    "excerpt": "See how the Andersons turned their dated kitchen into a stunning modern space with our Calacatta Gold quartz.",
    "category": "Case Studies",
    "date": "2025-01-20",
    "readTime": "4 min read",
    "image": "/images/blog/case-study-anderson.jpg",
    "tags": ["case-study", "quartz", "kitchen", "calacatta"],
    "content": "When the Anderson family approached us, their kitchen was functional but uninspiring. Dark laminate worktops, cramped layouts and poor lighting made cooking a chore rather than a pleasure.\n\nThe Brief: Create a bright, sociable kitchen that could serve as the heart of a busy family home. The worktop needed to be beautiful enough to impress but tough enough to survive three children under ten.\n\nThe Solution: We recommended our Calacatta Gold quartz—its warm white base and golden veining would brighten the space while the engineered composition would shrug off spills, stains and the occasional toy-car race.\n\nThe Result: The transformation was extraordinary. The new L-shaped worktop with waterfall edge became the room's focal point, while integrated drainage grooves and a flush-mounted sink kept the lines clean. Six months on, the Andersons report that their kitchen is now the room the whole family gravitates to."
  },
  {
    "id": 4,
    "slug": "caring-for-worktops",
    "title": "The Complete Guide to Caring for Your Stone Worktop",
    "excerpt": "Keep your worktop looking showroom-fresh with our expert maintenance tips for quartz, granite and marble.",
    "category": "Guides",
    "date": "2025-01-05",
    "readTime": "6 min read",
    "image": "/images/blog/care-guide.jpg",
    "tags": ["guides", "maintenance", "care"],
    "content": "A premium worktop is an investment, and like any investment, a little care goes a long way. Here's how to keep each material looking its best.\n\nQuartz: The easiest to maintain. Wipe daily with warm soapy water and a soft cloth. For stubborn marks, a non-abrasive cream cleaner works wonders. Avoid bleach and high-pH cleaners.\n\nGranite: Clean daily as with quartz. Reseal annually using a quality impregnating sealer—we supply these with every granite installation. Blot spills promptly rather than wiping, to prevent spreading.\n\nMarble: The most delicate of the three. Use pH-neutral cleaners only. Always use chopping boards and trivets. Reseal every 6–12 months. Marble will develop a patina over time—many owners consider this part of its charm."
  }
]
